In [20]:
import numpy as np
from pipeline import load_dataframe, TARGET_COL

df = load_dataframe()
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [8]:
counts = df[TARGET_COL].value_counts()
pcts = df[TARGET_COL].value_counts(normalize=True) * 100

print("Target distribution:")
for cls, cnt in counts.items():
    print(f"  {cls}: {cnt} ({pcts[cls]:.2f}%)")

imbalance = counts.max() / counts.min()
print(f"Imbalance ratio: {imbalance:.2f}:1")

Target distribution:
  0: 2219 (99.06%)
  1: 21 (0.94%)
Imbalance ratio: 105.67:1

In [10]:
missing = df.isnull().sum()
missing = missing[missing > 0]

print("Missing values:")
for col, cnt in missing.items():
    pct = (cnt / len(df)) * 100
    print(f"  {col}: {cnt} ({pct:.2f}%)")

Missing values:
  Income: 24 (1.07%)

In [13]:
num_cols = df.select_dtypes(include=[np.number]).columns.tolist()
print(f"Numeric features: {len(num_cols)}")

Numeric features: 26

In [19]:
cat_cols = df.select_dtypes(include=['object']).columns.tolist()
print(f"Categorical features: {len(cat_cols)}")

for name in cat_cols:
    unique_count = df[name].nunique(dropna=True)
    print(f"{name}: {unique_count} unique")

Categorical features: 3
Education: 5 unique
Marital_Status: 8 unique
Dt_Customer: 663 unique